<script>
    // @ts-nocheck
    import FamilyMembers from "../../commonElements/FamilyMembers.svelte";
    import { dateString } from "../../tools/dateString";
    import { toGujarati } from "../../tools/toGujarati";
    import { toString } from "../../tools/toString";
    import Pramanpatro from "./Pc1Parts/Pramanpatro.svelte";

    import { data } from "../../globalState/data";

    export let index;
    $: kNaam = toString($data[index].karmchariNaam[0], " ");
</script>

<div class="page-break-before border">
    <div class="center no-spacing">
        <h2>પેન્શન કેસ - ૧</h2>
        <h2><u>ભાગ - ૧</u></h2>
        <p>
            વય નિવૃત્તિને કારણે નિવૃત્ત થતાં કર્મચારીએ ૨૪ માસ પહેલાં અને
            સ્વૈચ્છિક નિવૃત્તિ લેતાં કર્મચારીએ સ્વૈચ્છિક નિવૃત્તિ તારીખ પછી
            તુરતજ તેમની કચેરીના વડાને નિવૃત્તિના લાભો મેળવવા માટે આપવાનું અરજી
            ફોર્મ
        </p>
    </div>
    <div class="no-spacing">
        <p>પ્રતિ,</p>
        <p>ઉચ્ચ શિક્ષણ કમિશ્નરશ્રી, જુના સચિવાલય,</p>
        <p>ગાંધીનગર.</p>
    </div>
    <p class="indent">
        હું શ્રી/શ્રીમતી
        {kNaam || ".".repeat(60)}
        હોદ્દો
        {$data[index].karmchariHoddo || ".".repeat(44)} તારીખ {$data[
            index
        ].avsaanTarik
            ?.filter((v) => v.trim())
            ?.join("/") ||
            toString($data[index].nivrutiTarikh, "/") ||
            ".".repeat(54)}
        ના રોજ વય નિવૃત્ત/સ્વૈચ્છિક નિવૃત્તિના કારણે નિવૃત્ત થાઉં છુ. મારા પેન્શન
        મંજુરી અર્થે નીચે મુજબની માહીતે ગુ.મુ.સેવા (પેન્શન) નિયમોના નિયમો ૧૨૮(૧)
        મુજબ રજું કરુ છું.
    </p>
    <table class="layed-out">
        <tr>
            <td>
                <span style="display: block">
                    ૧ સરકારી કર્મચારીનું નામ :
                </span>(સેવાપોથીમાં નોંધ્યા પ્રમાણે જો સુધારેલ હોય તો ગેઝેટનો
                આધાર રાખવો)
            </td>
            <td>
                <span style="display:block"> અટક </span>
                <b>{$data[index].karmchariNaam[0][1] || ".".repeat(48)}</b>
            </td>
            <td>
                <span style="display:block"> નામ </span>
                <b>{$data[index].karmchariNaam[0][2] || ".".repeat(48)}</b>
            </td>
            <td>
                <span style="display:block"> પિતા/ પતિનું નામ </span>
                <b>{$data[index].karmchariNaam[0][3] || ".".repeat(48)}</b>
            </td>
        </tr>
        <tr>
            <td>૨ હોદ્દો </td>
            <td colspan="3">
                {$data[index].karmchariHoddo || ".".repeat(44)}
            </td>
        </tr>
        <tr>
            <td> ૩ કચેરીનું નામ સરનામું અને ફોન નંબર : (પીન કોડ નંબર સાથે) </td>
            <td colspan="3">
                <b
                    >{$data[index].kacheriNaam ||
                        `${".".repeat(100)}\n`.repeat(3)}</b
                >
            </td>
        </tr>
        <tr>
            <td>૪ જન્મ તારીખ </td>
            <td>
                <span> DD </span>
                <b class="border field">
                    {$data[index].janmTarikh[0] || "."}
                </b>
            </td>
            <td>
                <span style="display:block"> MM </span>
                <b class="border field">
                    {$data[index].janmTarikh[1] || "."}
                </b>
            </td>
            <td>
                <span style="display:block"> YYYY </span>
                <b class="border field">
                    {$data[index].janmTarikh[2] || "."}
                </b>
            </td>
        </tr>
        <tr>
            <td> ૫ નોકરીમા દાખલ તારીખ </td>

            <td colspan="3">
                <b class="border field">
                    {toString($data[index].nokriDakhalTarikh, "/") || "."}
                </b>
            </td>
        </tr>
        <tr>
            <td> ૬ નિવૃત્તિની તારીખ : </td>
            <td colspan="3">
                <b class="border field">
                    {toString($data[index].nivrutiTarikh, "/") || "."}
                </b>
            </td>
        </tr>
        <tr>
            <td>
                <p class="indent">સત્રાંત</p>
            </td>
            <td colspan="3">
                <b class="border field">
                    {toString($data[index].santrat, "/") || "."}
                </b>
            </td>
        </tr>
        <tr>
            <td colspan="4">
                <p>
                    ૭ મારા યોગ્યરીતે શાખ કરાવેલ / પ્રમાણિત કરાવેલા નીચેના
                    દસ્તાવેજોની ત્રણ નકલ સામેલ છે.
                </p>
                <p class="indent">
                    (૧) ગુજરાતી તેમજ અંગ્રેજીમાં સહીના ત્રણ નમૂના
                </p>

                <p class="indent">
                    (૨) પતિ પત્નીના પાસપોર્ટ સાઈઝના ત્રણ સંયુક્ત ફોટોગ્રાફસ
                </p>

                <p class="indent">(3) ઊંચાઈ - અંગત ઓળખચિહ્ન</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>૮ પત્રવ્યવહારનું સરનામું</p>
                (પીનકોડ ટેલીફોન નંબર સાથે )
            </td>
            <td colspan="3">
                <b>
                    <!-- {$data[index].address ||
                        `${".".repeat(100)}\n`.repeat(3)} -->
                    {#if $data[index].address}
                        {#each $data[index].address.split("\n") as line}
                            <span style="display:block">{line}</span>
                        {/each}
                    {/if}
                </b>
            </td>
        </tr>
        <tr>
            <td colspan="2">
                <p style="margin-top: 5em;">કચેરીનું સીલ :</p>
            </td>
            <td colspan="2">
                <p style="margin-top: 5em;">કર્મચારીની સહી :</p>
            </td>
        </tr>
        <tr>
            <td colspan="4">
                <p>
                    ૯ જીલ્લા/ પેટા તિજોરીએથી પેન્શન મેળવવા માંગતા હોય તેનું નામ
                    <b>
                        {$data[index].petaTijori ||
                            $data[index].jillo ||
                            ".".repeat(40)}
                    </b>
                </p>
                <p>
                    જિલ્લો <b>{$data[index].jillo || ".".repeat(40)}</b>
                    તાલુકો <b>{$data[index].taluko || ".".repeat(40)}</b>
                </p>
            </td>
        </tr>

        <!-- needs to be discussed  -->
        <tr>
            <td colspan="4">
                <p>
                    ૧૦ હું મારા મળવાપાત્ર પેન્શનના
                    <b>
                        {$data[index].mudikrut ||
                            toGujarati($data[index].mudikrut || "") ||
                            ".".repeat(10)} ટકા
                    </b>
                    ભાગનું મૂડીકૃત રૂપાંતર કરી રૂપાંતરની કિંમત આપવા આજ તા.
                    {toGujarati(
                        dateString(
                            $data[index].mudikrutTarikh[2],
                            $data[index].mudikrutTarikh[1],
                            $data[index].mudikrutTarikh[0]
                        ) || ""
                    )
                        .split("-")
                        .reverse()
                        .join("-") || ".".repeat(40)}
                    ના રોજ વિનંતી કરું છું.
                </p>
            </td>
        </tr>
        <tr>
            <td colspan="4">
                <p>
                    નોંધ: પેન્શનના રૂપાંતરની અરજી નિવૃત્તિની તારીખ પછીના ૧૨ માસ
                    પછી કરવામાં આવે તો મેડીકલ બોર્ડના પ્રમાણપત્ર સાથે ફોર્મ
                    નં.-૧૬માં અરજી સામેલ કરવાની રહેશે.
                </p>
            </td>
        </tr>
        <tr>
            <td colspan="4">
                <p>
                    ૧૧ કુટુંબની વિગતો :ગુ.મુ.સેવા (પેન્શન) નિયમો-૨૦૦૨ ના નિયમ-૮૯
                    મુજબ
                </p>
            </td>
        </tr>
        <tr>
            <td colspan="4">
                તા. {toGujarati(
                    dateString(
                        $data[index].mudikrutTarikh[2],
                        $data[index].mudikrutTarikh[1],
                        $data[index].mudikrutTarikh[0]
                    ) || ""
                )
                    .split("-")
                    .reverse()
                    .join("-") || ".".repeat(40)}
                ના દીવસે મરા કુટુંબના સભ્યોની વિગત નીચે પ્રમાણે છે.
            </td>
        </tr>
    </table>
    <FamilyMembers />
    <p>
        હું બાહેંધરીપૂર્વક જાહેર કરું છું કે, મારા કુટુંબની વિગતો આજની તારીખે
        ઉપર મુજબ છે. તેમાં કોઈ પણ ફેરફાર થશે તો કચેરીના/ ખાતાના વડાને તેની જાણ
        કરીશ.
    </p>
    <p>
        ૧૨ સરકારશ્રીના નાણા વિભાગના તા.૨૩-૬-૨૦૦૦ ના ઠરાવ ક્રમાંકઃ
        ડીપીપી/૧૦૯૯/૪૯૬/૬૪૫(૪)પી મુજબ નિયત નમૂનામાં વારસ નિયુક્તિ ફોર્મની
        પ્રમાણિત નકલ આ સાથે સામેલ રાખું છું.
    </p>
    <p>
        મારા પુત્ર / પુત્રી / કુમારી
        <b>
            {$data[index].apangSabhya || ".".repeat(40)}
        </b>- અંધ અપંગ/મંદબુદ્ધિના છે તેને લાગતું સિવિલ સર્જનનું દાકતરી
        પ્રમાણપત્ર સામેલ રાખેલ છે, તેઓ જીવન નિર્વાહ પૂરતું કમાવા માટે અશક્તિમાન
        છે. તેમને કુટુંબપેન્શન ચૂકવવાનો પ્રસંગ ઉપસ્થિત થાય ત્યારે તેમના વળી
        તરીકે શ્રી/શ્રીમતિ .
        <b>
            {$data[index].vali || ".".repeat(123)}
        </b>
        ને ફરજ બજાવવા નીકું છું.
    </p>
    <p>ગુ,મુ.સેવા (પેન્શન) નિયમોના નિયમ-૯૩</p>
    <p>
        ઉપર જણાવેલ નિયમોમાં ફેરફાર કે સુધારા વધારા થાય તેવા પ્રસંગે પેન્શન એન
        પ્રોવિડંડ ફંડ નિયામકશ્રી/કચેરીના વડા તેમજ સંબંધકર્તાને જાણ કરી અદ્યતન
        રાખવાની બાહેંધરી આપું છું. ઉપરની વિગતો મારી કચેરીના વડા સમક્ષ આજ તારીખ {new Date(
            $data[index].mudikrutTarikh[2],
            $data[index].mudikrutTarikh[1] - 1,
            $data[index].mudikrutTarikh[0]
        ).toLocaleDateString("en-GB", {
            day: "numeric",
            month: "numeric",
            year: "numeric",
        })} ઉપસ્થિત થઇ પેન્શનની કાર્યવાહી અર્થે આપું છું. (કર્મચારીની માંદગી પ્રસંગે
        કે બહારગામ ગયા હોય તેવા પ્રસંગે પ્રતિનિધિ અથવા ટપાલ મારફતે ઉપરની વિગતો મોકલી
        આવી શકાશે)
    </p>

    <table class="layed-out" style="margin: 4em 0;">
        <tr>
            <td>
                <p>સ્થળ :</p>
            </td>
            <td>
                <p>કચેરીના વડાની સહી :</p>
            </td>
            <td>
                <p>કર્મચારીની સહી :</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>તારીખ :</p>
            </td>
            <td>
                <p>નામ અને હોદ્દો :</p>
            </td>
            <td>
                <p>નામ અને હોદ્દો :</p>
            </td>
        </tr>
    </table>
    <p>૧૫ વારસ નિયુક્તિ</p>

    <div class="indent">
        <p>
            (૧) મારા અવસાનના તુરત પહેલાના પેન્શન અંગેના લાભો સંબંધેની તમામ
            પ્રકારની ચડત લેણી રકમ જેવી કે પેન્શનની નકી લેણી રકમ, પેનાનની મૂડીકૃત
            રૂપાંતરની રકમ, મૃત્યુ-સહ-નિવૃત્તિ ગ્રેચ્યુઈટીની ચૂકવણી માટે તેમજ
            નિવૃત્તિ બાદ મારા અવસાન પ્રસંગે મારા કુટુંબને સહત તરીકેની રકમ ચૂકવણી
            માટે હું આ સાથેની મારી નિયુક્તિની પ્રમાણિત નકલ મુજબ ચુકવણી કરવા
            વિનંતી કરે છે, નકલ સામેલ છે)
        </p>
        <p>જો નિયુક્ત સગીર હોય તો</p>
        <p class="indent">
            (ક) જન્મ તારીખ :
            {($data[index].sagir &&
                dateString(
                    $data[index].nayuktSagir[2],
                    $data[index].nayuktSagir[1],
                    $data[index].nayuktSagir[0],
                    true
                )) ||
                ".".repeat(10)}
        </p>
        <p class="indent">
            (ખ) સગીર વય દરમ્યાન સદરહુ રકમ જે વ્યક્તિને વાલી તરીકે આપવાની હોય
            તેનું નામ: {$data[index].sadarhu || ".".repeat(30)}
        </p>
        <p class="center">વાલી તરીકે નિયુક્તિનો</p>
        <p>
            (સરનામું પીનકોડ સહિત):
            {$data[index].sagirAddress || ".".repeat(50)}
        </p>
        <p>
            (ગ) વાલી તરીકે નિયુક્તિનો પેન્શનર સાથે સંબંધ :
            {$data[index].pentionerSatheSambandh || ".".repeat(30)}
        </p>
    </div>
    <div>
        <p>
            ૧૬ બાહેંધરીપત્ર : ગુ.યુ.સેવા (પેન્શન) નિયમોના નિયમ ( ૧૩૪ / ૧૩૫ ) આથી
            હું
            <u
                >{toString(
                    $data[index].karmchariNaam[0] ||
                        $data[index].karmchariNaam[1],
                    " "
                ) || ".".repeat(40)}
            </u>
            હોદ્દો
            <u>
                {$data[index].karmchariHoddo || ".".repeat(40)}
            </u>
            બાહેંધરી ખત આપું છું કે, હું તા. {toString(
                $data[index].nivrutiTarikh,
                "/"
            ) || ".".repeat(40)} ના રોજ નિવૃત્ત થાઉ છું. તે પછીથી મારી પાસેથી કોઈ
            પણ સરકારી લેણું જેવું કે, પગાર, રજા પગાર ભથ્થાં, લીધેલ પેશગીઓ, લોન, ઘરભાડા
            અંગે થયેલ અધિક ચૂકવણીઓ સામે બાકી રહેતી રકમ પગારધોરણની સુધારણા કરતા થયેલ
            અધિક ચુકવણી અથવા અન્ય સરકારી લેણુ બાકી જણાય તો તે મારા પેન્શના મૃત્યુ
            સાહ ગ્રેજયુઈટીમાંથી ભરપાઈ કરવા બાહેંધરી સંમતિ આપું છું. નિવૃત્તિ બાદ
            સરકારી રહેણાંક ચાલુ રહેવાની મંજુરી આપવામાં આવે તો વસૂલ કરવાપાત્ર થતું
            મકાનભાડું મને મંજૂર કરવામાં આવેલ પેન્શના કુટુંબ પેન્શન અને તે પર મળવાપાત્ર
            ટી.આઈ.નથી તિજોરી કક્ષાએ વસુલાત કરવા બાહેંધરી તેમજ સંમતિ આપું છું.
        </p>
        <table class="layed-out">
            <tr>
                <td> સ્થળ : </td>
                <td> કર્મચારીની સહી : </td>
            </tr>
            <tr>
                <td> તારીખ : </td>

                <td>
                    <p>
                        નામ અને હોદ્દો : {toString(
                            $data[index].karmchariNaam[0] ||
                                $data[index].karmchariNaam[1],
                            " "
                        ) || ".".repeat(40)}
                    </p>
                    <p class="indent">
                        {$data[index].karmchariHoddo || ".".repeat(40)}
                    </p>
                </td>
            </tr>

            <tr>
                <td> કચેરીના વડાની સહી : </td>
            </tr>
        </table>
    </div>
</div>
<div class="page-break-before border">
    <table class="layed-out">
        <tr>
            <td style="width:70%;">
                ૧૯ પેન્શનપાત્ર નોકરી ગુ.મુ.સેવા (પેન્શન) નિયમોના નિયમ-૨૫
            </td>
            <td> વર્ષ </td>
            <td> માસ </td>
            <td> દિવસ </td>
        </tr>
        <tr>
            <td>
                (એ) એકંદર નોકરી તા............... થી
                તા................................... બાદ પેન્શન માટે ન ગણવાનો
                સમય
            </td>
        </tr>
        <tr>
            <td>
                (૧) ૩૬ માસથી વધારે અસાધારણ રજા તા.........................થી
                તા................................
            </td>
        </tr>
        <tr>
            <td>
                (૨) પેન્શનપાત્ર નોકરી તરીકે ન ગણવાના હૂકમો થયા હોય તેવો ફરજ
                મોકૂફીનો સમય તા.........................થી
                તા................................
            </td>
        </tr>
    </table>
</div>
<div>
    <table class="layed-out">
        <tr>
            <td style="width:80%;">
                ૨૦ નિવૃત્તિ/અવસાન / ૨૦ વર્ષ બાદ સ્વૈચ્છિક નિવૃત્તિ સમયનો છેલ્લો
                પગાર
            </td>
            <td> મુળ પગાર </td>
        </tr>

        <tr>
            <td>
                ૨૧ ૨૫ વર્ષ બાદ સ્વૈચ્છિક નિવૃત્તિ હોય તો નોશનલ નોકરીનો છેલ્લી
                તારીખે સંભવિત નોશનલ પગાર
            </td>
            <td> મુળ પગાર </td>
        </tr>
        <tr>
            <td colspan="2">
                ૨૨ ખરેખર મેળવેલ પેન્શાનપાત્ર પગારની વિગતો (મુ.સેવા (પેન્શન)
                નિયમોના નિયમ-૪૩)
            </td>
        </tr>
        <tr>
            <td colspan="2">
                <div style="margin-left: 5vw;">
                    <p>
                        તા. ..............................................થી
                        તા............................................
                    </p>
                    <p>
                        (૨૫ વર્ષ બાદની સ્વૈચ્છિક નિવૃત્તિ હોય તો નોશનલ પગાર
                        ધ્યાને લેવો )
                    </p>
                </div>
            </td>
        </tr>
    </table>
</div>
<table class="layed-out border">
    <thead>
        <tr>
            <th>ક્રમ</th>
            <th> માસ </th>
            <th> મુળ પગાર </th>
            <th> મોંઘવારી </th>
            <th> નોન પ્રેક્ટીસ એલાઉન્સ </th>
            <th> પૈસા </th>
        </tr>
    </thead>
    <tbody>
        {#each $data[index].monthWiseRecord as record, index}
            <tr>
                <td>{toGujarati(index + 1)}</td>
                <td>{record[0]}</td>
                <td>{record[1]}</td>
                <td>{record[2]}</td>
                <td>{record[3]}</td>
                <td>{record[4]}</td>
            </tr>
        {/each}
        <tr>
            <td colspan="2"> સરવાળો માસ </td>
            <td />

            <td />
            <td />
            <td />
        </tr>
        <tr>
            <td colspan="6"> માસિક સરેરાશ પેન્શનપાત્ર પગાર </td>
        </tr>
    </tbody>
</table>
<p>
    છેલ્લા આર.ઓ.પી.ની ચકાસણી એલ.એફ.કચેરીએ કરેલ છે અને ત્યાર પછીના વાર્ષિક ઇજાફા
    તથા બઢતી વગેરે અન્વયે નિયત કરી ચુકવવામાં આવેલ પગાર મેં ચકાસણી કરેલ છે અને તે
    બરાબર જણાયેલ છે, તે મુજબ પેન્શનપાત્ર પગાર ગણતરીમાં લીધેલ છે.
</p>
<p>(ગુ.મુ.સેવા(પેન્શન) નિયીન નિયમ-૧૩૦, ૧૩૧)</p>
<p>
    નોંધ: (૧) કર્મચારીની નિવૃત્તિના દસ માસ પૂર્વે છેલ્લા દસ માસમાં વગર પગારની
    રજા (LWP) હોય તો તે મુજબ તેમનો વગર પગારની રજા (LWP) ના પૂર્વેના સમયનો ચૂકવેલ
    પગાર દસ માસના હેતુ માટે ધ્યાનમાં લેવો (૨) કર્મચારી ફરજ મોકુફી પર હોય તે
    સમયને ફરજ મોકુફી તરીકે જ ગણેલ હોય તો જો કર્મચારી ફરજ મોકુફી પર જતાં પહેલાં
    મેળવેલ પગારના દસ માસના હેતુ માટે ધ્યાને લેવો.
</p>
<div style="margin-top: 5em;">
    <table class="layed-out">
        <tr>
            <td> કચેરીનું સીલ </td>
            <td>કચેરીના વડાની સહી અને સિક્કા</td>
        </tr>
    </table>
</div>
<div>
    <p>૨૩ પેનાનની ગણતરી ( ગુ.મુ.સેવા (પેન્શન) નિયમોના નિયમ- ૮૦)</p>
    <p class="indent">
        (૧) (૧) પેન્શનપાત્ર પગાર – પેન્શનપાત્ર નોકરી (વધુમના વધુ 33 વર્ષ) =
        પેન્શન
    </p>

    <p class="indent">(૧) (૧)</p>
    <p class="center">અથવા</p>
    <p class="indent">(૧)(૨) પેન્શન = છેલ્લો પગારના ૫૦ % =</p>

    <p>
        (૨) જો કોઈ કિસ્સામાં ઉપર જણાવેલ મુજબનું પેન્શન રીવીઝન ઓફ પે-૯૮ના
        પગારધોરણ મુજબ છેલ્લે જગ્યા ધરવતા હોય તેના સ્કેલના લઘુતમના ૫૦% કરતાં ઓછું
        થતું હોય તો તે પગારધોરણના લઘુતમ પગારના ૫૦ ટકા મુજબ પેન્શન રહેશે.
    </p>

    <p>લઘુતમ પગાર =</p>

    <p>ઉપરોક્ત (૧) અથવા (૨) પૈકી જે વધારે હોય તે =રૂ.</p>

    <p>૨૪ કુટુંબ પેન્શન ગુ.યુ.સેવા (પેન્શન) નિયમોના નિયમ- ૯૦ (૧) (૨)</p>
    <p>(૧) નિવૃત્તિ બાદ અવસાન</p>
    <p>(એ) કુટુંબ પેન્શન - ૧</p>
    <p>
        અવસાનની તારીખ પછીની તારીખથી સાત વર્ષ સુધી અથવા કર્માથી જીવતા હોત અને ૬૫
        વર્ષની ઉંમરે પહોંચે ત્યાં સુધી આ બે પૈકી જે વહેલું હોય ત્યો સુધી નીચે
        મુજબ કુટુંબ પેન્શન મળવાપાત્ર બનશે.
    </p>

    <p>કર્મચારીને મંજૂર થયેલ પેન્શન કેટલી રકમ રૂ. =</p>
    <p>
        નોંધ : કોઈ પણ સંજોગોમાં છેલ્લા પગારના ૩૦% કરતાં ઓછી નહિ તેટલી રકમ હોવી
        જોઈએ એટલે કે છેલ્લા પગારના ૩૦%
    </p>
    <p>છેલ્લો પગાર રુ. X =</p>
    <p>(બી) કુટુંબ પેન્શન -૨</p>
    <p>
        (ઉંપર (૧) (એ) માં દર્શાવેલ સમયગાળા બાદ મળવાપાત્ર કુટુંબ પેન્શન છેલ્લા
        પગારના ૩૦% જેટલી રકમ રૂ. =
    </p>
    <p>છેલ્લો પગાર રુ. X =</p>
    <div style="margin-top: 5em;">
        <table class="layed-out">
            <tr>
                <td> કચેરીનું સીલ </td>
                <td>કચેરીના વડાની સહી અને સિક્કા</td>
            </tr>
        </table>
    </div>
</div>
<div>
    <p>૨} ચાલુ નોકરીમાં અવસાન : (નિયમ -૯૦ (૧) (૧) )</p>
    <p>X (એ) કુટુંબ પેન્શન – ૧</p>
    <p class="indent">
        ચાલુ નોકરીએ અવસાન થઇ ત્યરે અવસાનની તારીખ પછીથી તારીખથી પ્રથમ દસ વર્ષ
        માટે પરંતુ કર્મચારી જીવતા હોત અને ૬૫ વર્ષની ઉંમરે પહોંચે તે તારીખ સુધી
        બે પૈકી જે વહેલું હોય ત્યાં સુધી નીચે મુજબ કુટુંબ પેન્શન મળવાપાત્ર થશે.
    </p>
    <p class="indent">છેલ્લા પગારના ૫૦% જેટલી રકમ રૂ.</p>
    <p class="indent">છેલ્લો પગાર X ૫૦ % = રુ.</p>
    <p>X (બી) કુટુંબ પેન્શન - ૨</p>
    <p class="indent">
        ત્યારબાદ એટલે કે કર્મચારીના અવસાનની તારીખ પછીની તારીખથી ૧૦ વર્ષ પછી
        છેલ્લા પગારના ૩૦% જેટલી રકમ રુ.
    </p>
    <p class="indent">છેલ્લો પગાર X ૩૦ % = રુ</p>
    <p>૨૫ મૃત્યુ-સહ-નિવૃત્તિ ગ્રેચ્યુઇટી / સેવા ગ્રેચ્યુઇટી :</p>
    <p class="indent">
        (અ) મૃત્યુ-સહ-નિવૃત્તિ-ગ્રેચ્યુઈટી (ગુ.ર.સેવા (પેન્શન) નિયમોના નિયમ-૮૧)
        (૧) (એ) ૧.
    </p>
    <p class="indent">
        નિવૃત્તિ સમયે : (છેલ્લો પગાર + મોંઘવારી) × પેન્શનપાત્ર નોકરી વર્ષ
        (મહત્તમ ૩૩ વર્ષ) =
    </p>
    <p>
        X ૨. ચાલુ નોકરીએ અવસાન સમયે : ગુ.યુ.કે. (પેન્શન) નિયમો-૨૦૦૨ના નિયમ-૮૧(૧)
        (બી)
    </p>
    <p class="indent">(એ) એક વર્ષ કરતાં ઓછી પેન્શનપાત્ર નોકરી હોય તે પ્રસંગે</p>
    <p class="indent">(છેલ્લો પગાર + મોંઘવારી ) × ૨=</p>
    <p>
        X (બી) એક વર્ષ કે તે કરતાં વધુ પરંતુ પાંચ વર્ષ કરતાં ઓછી પેન્શનપાત્ર
        નોકરી હોય તે પ્રસંગે
    </p>
    <p class="indent">(છેલ્લો પગાર + મોંઘવારી ) × ૬ =</p>
    <p>
        X (સી) પાંચ વર્ષ કે વધુ પરંતુ ૨૦ વર્ષ કરતાં ઓછી પેન્શનપાત્ર નોકરી હોય તે
        પ્રસંગે
    </p>
    <p class="indent">(છેલ્લો પગાર + મોંઘવારી ) × ૧૨ =</p>
    <p>
        X ૨૦ વર્ષ કે તેના કરતાં વધુ નોકરી કરી હોય ત્યાં મહત્તમ હોય મહત્તમ ૩૩
        વર્ષની મર્યાદામાં જેટલા વર્ષની પેન્શનપાત્ર નોકરી હોય તેટલા પગાર
    </p>
    <p class="indent">(છેલ્લો પગાર + મોંઘવારી ) × ૧૨ =</p>
</div>
<div style="margin-top: 5em;">
    <table class="layed-out">
        <tr>
            <td> કચેરીનું સીલ </td>
            <td>
                <p class="center">આચાર્ય</p>
                <p class="center">કચેરીના વડાની સહી અને સિક્કા</p>
            </td>
        </tr>
    </table>
</div>
<ul>
    <li>સેવા ગ્રેજ્યુઇટી</li>
</ul>
<div>
    <p>
        ૧૦ વર્ષ કરતા ઓછી પેન્શનપાત્ર નોકરીના કિસ્સામા સેવા
        ગ્રેજ્યુઇટી(ગુ.મુ.સેવા(પેન્શન) નિયમોના નિયમ-૮૦
    </p>
    <p class="indent">
        (છેલ્લો પગાર + મોંઘવારી) × પુરી કરેલી નોકરીના વર્ષ = રુ.
    </p>
</div>
<div>
    <p>(૨૭) પેન્શનની રકમનું મુડીકૃત(ગુ.મુ.સેવા(પેન્શન) નિયમોના નિયમ – ૧૦૦ )</p>
    <p class="indent">
        પેન્શનના મુડીકુત રુપાંતર માટે નજીકની ઉંમરના આધારે એક રુપિયાની રુપાંતર
        કરેલ રકમ માટે મુડીકૃત રકમ :
    </p>
    <table class="border layed-out">
        <thead>
            <tr>
                <th>ઉંમર </th>
                <th>દર </th>
                <th>ઉંમર </th>
                <th>દર </th>
                <th>ઉંમર </th>
                <th>દર </th>
                <th>ઉંમર </th>
                <th>દર </th>
            </tr>
        </thead>
        {#each $data[index].mudikrutRakam as rakam}
            <tr class="center">
                <td>{toGujarati(rakam[0] || "")}</td>
                <td>{toGujarati(rakam[1] || "")}</td>
                <td>{toGujarati(rakam[2] || "")}</td>
                <td>{toGujarati(rakam[3] || "")}</td>
                <td>{toGujarati(rakam[4] || "")}</td>
                <td>{toGujarati(rakam[5] || "")}</td>
                <td>{toGujarati(rakam[6] || "")}</td>
                <td>{toGujarati(rakam[7] || "")}</td>
            </tr>
        {/each}
    </table>
</div>
<p class="center">નક્કી થયેલ પેન્શન × ૪૦.૦૦% = રુપાંતર પેંશન</p>

<p class="center">રુપાંતર પેન્શન ભાગ × રુપાંતર દર × ૧૨ =</p>

<div style="margin-top: 5em;">
    <table class="layed-out">
        <tr>
            <td>
                <p class="center">આચાર્ય</p>
                <p class="center">કચેરીના વડાની સહી અને સિક્કા</p>
            </td>
        </tr>
    </table>
</div>
<div>
    <p>(૨૮) નિવૃત્તિના લાભોમાથી કપાત કરવાની હોય તોતેની વિગત</p>
    <p class="indent">
        (૧) પેન્શનમાંથી કપાત રુ.
        ................................................... તા.
        ......................................... થી તા.
        ........................................................
        સુધી........................................................ રુ
        ................................................. તા.
        ............................................. થી કાયમી કપાત પેન્શનમાંથી
        કપાત કરવાના સિક્ષા હુકમ નંબર
        ......................................................તા
        ...................................................પેન્શન કાપના શિક્ષાના
        હુકમની નકલ સામેલ છે.
    </p>

    <p>(૨) સરકારી કર્મચારી પાસેથી લેણી રકમની વિગત નીચે મુજબ છે.</p>

    <table class="layed-out border">
        <thead>
            <tr>
                <th> ક્રમ </th>
                <th>વિગત</th>
                <th>ખાતા નંબર</th>
                <th>મુદ્દલ</th>
                <th>વ્યાજ</th>
                <th>કુલ</th>
                <th>જમા કરાવવાનું અંદાજપત્ર સદર</th>
            </tr>
        </thead>

        <tbody>
            {#each $data[index].leniRakamNiVigato as row, i}
                {#if i < 4}
                    <tr>
                        <td>
                            {toGujarati(i + 1 || "")}
                        </td>
                        <td>{row[0]}</td>
                        <td>{row[1]}</td>
                        <td>{row[2]}</td>
                        <td>{row[3]}</td>
                        <td>{row[4]}</td>
                        <td>{row[5]}</td>
                    </tr>
                {:else}
                    <tr>
                        <td colspan="2"> કુલ વસુલાત્ </td>
                        <td>{row[0]}</td>
                        <td>{row[1]}</td>
                        <td>{row[2]}</td>
                        <td>{row[3]}</td>
                        <td>{row[4]}</td>
                    </tr>
                {/if}
            {/each}
        </tbody>
    </table>
    <p>
        ઉપર જણાવેલ વિગતે રકમ સર કારી લેણા પેતે મૃત્યુ - સહ - નિવૃતિ -
        ગ્રેજ્યુટી/સેવા ગ્રેજ્યુઇટીમાંથી વસુલાત કરી જમા કરવા વિનંતી છે.
    </p>
</div>
<Pramanpatro {index} />

<style>
    .field {
        display: block;
        width: 80%;
        padding: 0 0.5em;
    }
</style>
