<script>
  // prop: page - array of page numbers
  export let page = [];
</script>

<div class="page">
  <table>
    <thead>
      <tr>
        <th>ક્રમ</th>
        <th>પેંશન પેપર્સ સાથેના રજુ કરવાના દસ્તાવેજો</th>
        <th>પાના નં</th>
      </tr>
    </thead>
    <tbody>
      <tr>
        <td>૧</td>
        <td> અસલ સેવાપોથી</td>
        <td>{page[0] || ""}</td>
      </tr>
      <tr>
        <td>૨</td>
        <td>પેન્શન બુક</td>
        <td>{page[1] || ""}</td>
      </tr>
      <tr>
        <td>૩</td>
        <td
          >અસલ પેન્શન વિકલ્પ ઉપરાંત તેની બે પ્રમાણિત નકલો(લાગુ પડતુ હોય તો)
        </td>

        <td>{page[2] || ""}</td>
      </tr>
      <tr>
        <td>૪</td>
        <td
          >અસલ સંસ્થા ફાળા પ્રમાણપત્ર ઉપરાંત તેની બે પ્રમાણિત નકલો(લાગુ પડતું
          હોય તો)
        </td>

        <td>{page[3] || ""}</td>
      </tr>
      <tr>
        <td>૫</td>
        <td
          >નાણા વિભાગના તા.૨૩/૦૬/૨૦૦૦ ના ઠરાવ મુજબનું અસલ નોમીનેશન ઉપરાંત તેની
          બે પ્રમાણિત નકલ
        </td>

        <td>{page[4] || ""}</td>
      </tr>
      <tr>
        <td>૬</td>
        <td>
          ક્રમ નં. (૨), (૩) તથા (૪) મુજબના અસલ દસ્તાવેજો સેવાપોથીમાં જ સામેલ
          રાખવા
        </td>

        <td>{page[5] || ""}</td>
      </tr>
      <tr>
        <td>૭</td>
        <td>અવસાનના કિસ્સામાં ડેથ સર્ટીફીકેટની બે પ્રમાણિત નકલો</td>

        <td>{page[6] || ""}</td>
      </tr>
      <tr>
        <td>૮</td>
        <td>
          અવસાનના કિસ્સામાં કર્મચારીએ પોતાની હયાતી દરમ્યાન નિયત નમૂના મુજબનું
          નોમીનેશન ન ભરેલ હોય તો મામલતદાર કક્ષાના અધિકારીશ્રી દ્વારા આપેલ
          પેઢીનામાંની બે પ્રમાણિત નકલો
        </td>

        <td>{page[7] || ""}</td>
      </tr>
      <tr>
        <td>૯</td>
        <td>
          અવસાનના કિસ્સામાં પેન્શન સેટના ભાગ (૧) થી (૫) સુધીની સંપૂર્ણ વિગતો
          ભરવી
        </td>

        <td>{page[8] || ""}</td>
      </tr>
      <tr>
        <td>૧૦</td>
        <td>
          આર.ઓ.પી.-૨૦૧૬ મુજબ પે વેરીફીકેશનનું વેરીફીકેશન થયા અંગેનું સ્ટીકર
          સેવાપોથીમાં લાગેલ હોવું જોઈએ.
        </td>

        <td>{page[9] || ""}</td>
      </tr>
      <tr>
        <td>૧૧</td>
        <td>
          સ્વૈચ્છિક નિવૃત્તિના કિસ્સામાં આ કચેરીના સ્વૈચ્છિક નિવૃત્તિના આદેશની
          બે પ્રમાણિત નકલો (આ કચેરી દ્વારા સ્વૈચ્છિક નિવૃત્તિના મંજૂરી આદેશ મળે
          ત્યારબાદ જ કર્મચારીને સેવા મુક્ત કરવો).
        </td>

        <td>{page[10] || ""}</td>
      </tr>
      <tr>
        <td>૧૨</td>
        <td>
          સ્વૈચ્છિક નિવૃત્તિ ના કિસ્સામાં સંસ્થાએ સેવામુક્ત કર્યાનાં આદેશની બે
          પ્રમાણિત નકલો.
        </td>

        <td>{page[11] || ""}</td>
      </tr>
      <tr>
        <td>૧૩</td>
        <td>
          સેવાપોથીના પ્રથમ પાને કર્મચારીની જન્મતારીખ ની વિગત સક્ષમ અધિકારીની
          સહીથી પ્રમાણિત કરવી.
        </td>

        <td>{page[12] || ""}</td>
      </tr>
      <tr>
        <td>૧૪</td>
        <td>
          સેવાપોથીમાં રજાના હિસાબોની તથા ઇજાફાઓની તમામ નોંધો સક્ષમ અધિકારીની
          સહીથી થયેલ હોવી જોઈએ.
        </td>

        <td>{page[13] || ""}</td>
      </tr>
      <tr>
        <td>૧૫</td>
        <td
          >કર્મચારીનો નિમણૂક હુકમ, નિવૃત્તિ હુકમ અંગેના સંસ્થાના ઠરાવની પ્રમાણિત
          નકલ કર્મચારીના એકરારનામા સાથે રજુ કરવી.
        </td>

        <td>{page[14] || ""}</td>
      </tr>
      <tr>
        <td>૧૬</td>
        <td
          >અન્ય કોઈ પેન્શન મેળવતાં નથી તે અંગેનું કર્મચારીનું તેમજ આચાર્યશ્રીનું
          એકરારનામું મોકલવું.
        </td>

        <td>{page[15] || ""}</td>
      </tr>
      <tr>
        <td>૧૭</td>
        <td
          >અન્ય કોઈ પેન્શન મેળવતાં નથી તે અંગેનું કર્મચારીનું તેમજ આચાર્યશ્રીનું
          એકરારનામું મોકલવું.
        </td>

        <td>{page[16] || ""}</td>
      </tr>
      <tr>
        <td>૧૮</td>
        <td>કોઈ સરકારી લેણું બાકી નથી તે બદલનું પ્રમાણપત્ર આપવું.</td>

        <td>{page[17] || ""}</td>
      </tr>
      <tr>
        <td>૧૯</td>
        <td
          >કર્મચારીની નોકરી દરમ્યાન સંસ્થા અને કર્મચારી વચ્ચે કોઈ ટ્રીબ્યુનલ
          કેસ, કોર્ટ કેસ થયેલ હોય કે કર્મચારીને કોઈ શિસ્ત વિષયક બાબત દંડ કે સજા
          થયેલ હોય તો તેની વિગત સામેલ રાખવી.
        </td>

        <td>{page[18] || ""}</td>
      </tr>
      <tr>
        <td>૨૦</td>
        <td
          >એકથી વધારે સંસ્થામાં સેવા આપેલ હોય તો સેવા જોડાણનો હુકમ સામેલ રાખવો.
        </td>

        <td>{page[19] || ""}</td>
      </tr>
      <tr>
        <td>૨૧</td>
        <td
          >સી.સી.સી. પરીક્ષા પાસ કર્યાના આધારની બે પ્રમાણિત નકલો (જો લાગુ પડતું
          હોય તો)
        </td>

        <td>{page[20] || ""}</td>
      </tr>
      <tr>
        <td>૨૨</td>
        <td
          >નામ/અટક ફેરફાર કરાવેલ હોય તો તે અંગે ગેઝેટના આધારની નકલ તાતા
          સેવાપોથીમાં નામ / અટક ફેરફારની નોંધ સક્ષમ અધિકારીની સહીથી થયેલ હોવી
          જોઈએ,
        </td>

        <td>{page[21] || ""}</td>
      </tr>
      <tr>
        <td colspan="3">
          નામ/અટક ફેરફાર કરાવેલ હોય તો તે અંગે ગેઝેટના આધારની નકલ તાતા
          સેવાપોથીમાં નામ / અટક ફેરફારની નોંધ સક્ષમ અધિકારીની સહીથી થયેલ હોવી
          જોઈએ.
        </td>
      </tr>
    </tbody>
  </table>
</div>

<style>
  table {
    width: 100%;
    border-collapse: collapse;
  }
  table,
  td,
  th {
    border: 1px solid black;
  }
  td {
    padding: 0.3em;
  }
</style>
