export const mudikrutRakam = [
    [20, "45", "", "", "", "", "", "", ],
    [21, "", "", "", "", "", "", "", ],
    [22, "", "", "", "", "", "", "", ],
    [23, "", "", "", "", "", "", "", ],
    [24, "", "", "", "", "", "", "", ],
    [25, "", "", "", "", "", "", "", ],
    [26, "", "", "", "", "", "", "", ],
    [27, "", "", "", "", "", "", "", ],
    [28, "", "", "", "", "", "", "", ],
    [29, "", "", "", "", "", "", "", ],
    [30, "", "", "", "", "", "", "", ],
    [31, "", "", "", "", "", "", "", ],
    [32, "", "", "", "", "", "", "", ],
    [33, "", "", "", "", "", "", "", ],
    [34, "", "", "", "", "", "", "", ],
    [35, "", "", "", "", "", "", "", ],
]

export const mudikrut = "40"

export const pensionPrakar = ['વયનિવૃત પેન્શન',
    'નિવૃત પેન્શન(અપરિપક્વ નિવૃતિ)',
    'સ્વૈચ્છિક નિવૃત પેન્શન(૨૦ વર્ષ પછી)',
    'અશક્તા પેન્શન',
    'સ્વૈચ્છિક નિવૃત પેન્શન(૨૫ વર્ષ પછી)',
    'ધા અને ઇજા પેન્શન',
    'કુટુંબ પેન્શન',
    'વળતર પેન્શન',
    'રહેમિયત પેન્શન',
    'અન્ય પેન્શન'
]